using UnityEngine;

public class PipeScript : MonoBehaviour
{
    void Start()
    {
        
    }

    void Update()
    {

    }
}

/* Д.З. Створити декілька префабів різного призначення:
 * хмари, різновиди їжі, бонуси-життя. Забезпечити їх появу, рух
 * полем гри, знищення після виходу, а також при контакті з птахом.
 * За наявності однотипних елементів (різні хмари, різні бонуси) - 
 *  робити випадковий вибір при їх генерації.
 * Прикласти відео/gif запис роботи проєкту.
 */

/* Д.З. Підібрати діапазон величин для швидкості перешкоди "speed"
 * Мінімальне та максимальне значення - у відповідності до складності
 * (але можливості) гри.
 * Прикласти відео/gif запис роботи проєкту.
 */